app/Controllers/Book.php

    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','anda harus login');
        }

        $data = array(
            'book' => $this->bookmodel
                    ->select('book.id as id,book.title,book.author,book.publisher_year,publisher.name,category.category,book.quantity')
                    ->join('publisher', 'book.id_publisher=publisher.id','left')
                    ->join('category', 'book.id_category=category.id','left')
                    ->findAll(),
        );
---
SELECT `book`.`id` as `id`, `book`.`title`, `book`.`author`, `book`.`publisher_year`, `publisher`.`name`, `category`.`category`, `book`.`quantity`
FROM `book`
LEFT JOIN `publisher` ON `book`.`id_publisher`=`publisher`.`id`
LEFT JOIN `category` ON `book`.`id_category`=`category`.`id`
WHERE `book`.`deleted_at` IS NULL