app/Controllers/Borrower.php

    public function index()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }
        $data = array(
            'borrower' => $this->BorrowerModel->findAll(),
        );
---
SELECT *
FROM `borrower`
WHERE `borrower`.`deleted_at` IS NULL

            return redirect()->to('borrower-add')->withInput();
        }

        $this->BorrowerModel->save([
            'name' => $post['name'],
            'birthdate' => $post['birthdate'],
            'address' => $post['address'],
            'gender' => $post['gender'],
            'contact' => $post['contact'],
            'email' => $post['email'],
        ]);
---
INSERT INTO `borrower` (`name`, `birthdate`, `address`, `gender`, `contact`, `email`, `created_at`, `updated_at`) VALUES ('ccc', '2023-05-16', 'KB.Bekasi', 'P', '088220793107', 'ccc@gmail.com', '2023-05-16 05:20:23', '2023-05-16 05:20:23')

    public function edit($id)
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }

        $data = array(
            'item'  => $this->BorrowerModel->where(['id' => $id])->first(),
            'id'    => $id,
        );
---
SELECT *
FROM `borrower`
WHERE `id` = '4'
AND `borrower`.`deleted_at` IS NULL
 LIMIT 1

    public function editpro()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }

        $post = $this->request->getPost();
        $datapost = $this->BorrowerModel->where(['id' => $post['id']])->first();

        if ($post['email'] == $datapost['email']) {
            if (!$this->validate([
                'name' => [
                    'rules' => 'required',
                    'errors' => ['required' => 'wajib diisi'],
                ],
                'contact' => [
                    'rules' => 'required|alpha_numeric',
                    'errors' => [
                        'required' => 'wajib diisi',
                        'alpha_numeric' => 'khusus angka',
                    ],
                ],
            ])) {
                $validation = \config\Services::validation();
                session()->setFlashdata('validation', $validation->getErrors());
                return redirect()->to('borrower-add')->withInput();
            }
            $this->BorrowerModel->save([
                'id'    => $post['id'],
                'name' => $post['name'],
                'contact' => $post['contact'],
            ]);
---
SELECT *
FROM `borrower`
WHERE `id` = '1'
AND `borrower`.`deleted_at` IS NULL
 LIMIT 1
UPDATE `borrower` SET `name` = 'Alvi', `contact` = '088220793107', `updated_at` = '2023-05-15 06:30:04'
WHERE `borrower`.`id` IN ('1')

    public function delete($id)
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }

        $delete = $this->BorrowerModel->delete($id);
---
UPDATE `borrower` SET `deleted_at` = '2023-05-16 05:20:42', `updated_at` = '2023-05-16 05:20:42'
WHERE `id` IN ('4')
AND `deleted_at` IS NULL