app/Controllers/Borrow.php

SELECT `borrow`.`id` as `id`, `borrower`.`name`, `book`.`title`, `staff`.`email`, `borrow`.`release_date`, `borrow`.`due_date`, `borrow`.`note`
FROM `borrow`
LEFT JOIN `borrower` ON `borrow`.`id_borrower`=`borrower`.`id`
LEFT JOIN `book` ON `borrow`.`id_book`=`book`.`id`
LEFT JOIN `staff` ON `borrow`.`id_staff`=`staff`.`id`
WHERE `borrow`.`deleted_at` IS NULL
---
    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','anda harus login');
        }

        $data = array(
            'borrow' => $this->borrowmodel
                    ->select('borrow.id as id,borrower.name,book.title,staff.email,borrow.release_date,borrow.due_date,borrow.note')
                    ->join('borrower', 'borrow.id_borrower=borrower.id','left')
                    ->join('book', 'borrow.id_book=book.id','left')
                    ->join('staff', 'borrow.id_staff=staff.id','left')
                    ->findAll(),
        );

SELECT *
FROM `borrower`
WHERE `borrower`.`deleted_at` IS NULL
SELECT *
FROM `book`
WHERE `book`.`deleted_at` IS NULL
SELECT *
FROM `staff`
WHERE `staff`.`deleted_at` IS NULL
---
    public function add()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }

        $data = array(
            'borrower' => $this->borrowermodel->findAll(),
            'book' => $this->bookmodel->findAll(),
            'staff' => $this->staffmodel->findAll(),
        );

SELECT *
FROM `borrow`
WHERE `id` = '9'
AND `borrow`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `borrower`
WHERE `borrower`.`deleted_at` IS NULL
SELECT *
FROM `book`
WHERE `book`.`deleted_at` IS NULL
SELECT *
FROM `staff`
WHERE `staff`.`deleted_at` IS NULL
---
    public function edit($id)
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }

        $data = array(
            'item'  => $this->borrowmodel->where(['id' => $id])->first(),
            'id'    => $id,
            'borrower' => $this->borrowermodel->findAll(),
            'book' => $this->bookmodel->findAll(),
            'staff' => $this->staffmodel->findAll(),
        );

SELECT *
FROM `borrow`
WHERE `id` = '9'
AND `borrow`.`deleted_at` IS NULL
 LIMIT 1
UPDATE `borrow` SET `id_borrower` = '5', `id_book` = '10', `id_staff` = '6', `release_date` = '2023-05-17', `due_date` = '2023-05-17', `note` = 'Mengembalikan', `updated_at` = '2023-05-17 04:48:13'
WHERE `borrow`.`id` IN ('9')
---
    public function editpro()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }

        $post = $this->request->getPost();
        $datapost = $this->borrowmodel->where(['id' => $post['id']])->first();

        if ($post['id_borrower'] == $datapost['id_borrower']) {
            if (!$this->validate([
                'id_borrower' => [
                    'rules' => 'required',
                    'errors' => ['required' => 'wajib diisi'],
                ],
                'id_book' => [
                    'rules' => 'required',
                    'errors' => [
                        'required' => 'wajib diisi',
                        'alpha_numeric' => 'khusus angka',
                    ],
                ],
            ])) {
                $validation = \config\Services::validation();
                session()->setFlashdata('validation', $validation->getErrors());
                return redirect()->to('borrow-edit'/$post['id'])->withInput();
            }
            $this->borrowmodel->save([
                'id'    => $post['id'],
                'id_borrower' => $post['id_borrower'],
                'id_book' => $post['id_book'],
                'id_staff' => $post['id_staff'],
                'release_date' => $post['release_date'],
                'due_date' => $post['due_date'],
                'note' => $post['note'],
            ]);

UPDATE `borrow` SET `deleted_at` = '2023-05-19 04:26:56', `updated_at` = '2023-05-19 04:26:56'
WHERE `id` IN ('12')
AND `deleted_at` IS NULL
---
    public function del($id)
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }

        $delete = $this->borrowmodel->delete($id);