app/Controllers/Publisher.php

SELECT *
FROM `publisher`
WHERE `publisher`.`deleted_at` IS NULL
---
    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','anda harus login');
        }

        $data = array(
            'publisher' => $this->publishermodel->findAll(),
        );