app/Controllers/Staff.php

SELECT *
FROM `staff`
WHERE `staff`.`deleted_at` IS NULL
---
    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','anda harus login');
        }

        $data = array(
            'staff' => $this->staffmodel->findAll(),
        );

INSERT INTO `staff` (`name`, `email`, `password`, `created_at`, `updated_at`) VALUES ('Zidan', 'zidan@gmail.com', 'f379eaf3c831b04de153469d1bec345e', '2023-05-16 05:21:29', '2023-05-16 05:21:29')
---
            return redirect()->to('staff-add')->withInput();
        }

            $this->staffmodel->save([
                'name' => $post['name'],
                'email' => $post['email'],
                'password' => md5($post['password']),
            ]);